map_img_dic =  {
  "地面": "画像素材/ゲームタイル/地面.png",
  "土": "画像素材/ゲームタイル/土.png",
  "岩": "画像素材/ゲームタイル/岩.png",
  "レンガ": "画像素材/ゲームタイル/レンガ.png",
  "シルバーレンガ": "画像素材/ゲームタイル/シルバーレンガ.png",
  "タイルブラック": "画像素材/ボスタイル/タイルブラック.png",
  "階段_右": "画像素材/ボスタイル/階段_右.png",
  "階段_左": "画像素材/ボスタイル/階段_左.png",
  "階段_中央": "画像素材/ボスタイル/階段_中央.png",
  "柱_下": "画像素材/ボスタイル/柱_下.png",
  "柱_上": "画像素材/ボスタイル/柱_上.png",
  "柱_中央": "画像素材/ボスタイル/柱_中央.png",
  "カーペット赤": "画像素材/ボスタイル/カーペット赤.png"
}


prayer_img_dic = {
  "エンペラー号": "画像素材/マシン/エンペラー号.PNG",
  "カイザー号": "画像素材/マシン/カイザー号.PNG",
  "ミカド号": "画像素材/マシン/ミカド号.PNG",
  "オウエンペラー": "画像素材/マシン/オウエンペラー.PNG",
  "オウカイザー": "画像素材/マシン/オウカイザー.PNG",
  "オウミカド": "画像素材/マシン/オウミカド.PNG",
  "右鎌": "画像素材/攻撃エフェクト/右鎌.PNG",
  # "左鎌": "画像素材/攻撃エフェクト/左鎌.PNG",
  "おろし_1": "画像素材/攻撃エフェクト/おろし_1.PNG",
  "おろし_2": "画像素材/攻撃エフェクト/おろし_2.PNG",
  "ドリル": "画像素材/攻撃エフェクト/ドリル.PNG",
  "タケノコ": "画像素材/攻撃エフェクト/タケノコ.PNG"
}


mob_img_dic = {
  "クモ": "画像素材/モブ/クモ.PNG",
  "鬼_1": "画像素材/モブ/鬼_1.PNG",
  "鬼_2": "画像素材/モブ/鬼_2.PNG",
  "鬼_3": "画像素材/モブ/鬼_3.PNG",
  "九尾": "画像素材/モブ/九尾.PNG",
  "月人_1": "画像素材/モブ/月人_1.PNG",
  "月人_2": "画像素材/モブ/月人_2.PNG",
  "月人_3": "画像素材/モブ/月人_3.PNG",
  "月人_4": "画像素材/モブ/月人_4.PNG",
  "大顔": "画像素材/モブ/大顔.PNG",
  "唐傘": "画像素材/モブ/唐傘.PNG",
  "護符": "画像素材/敵エフェクト/護符.PNG"
}



sraid_img_dic = {
  "スライド1": "画像素材/説明スライド/スライド1.PNG",
  "スライド2": "画像素材/説明スライド/スライド2.PNG",
  "スライド3": "画像素材/説明スライド/スライド3.PNG",
  "スライド4": "画像素材/説明スライド/スライド4.PNG",  
  "スライド5": "画像素材/説明スライド/スライド5.PNG",  
  "スライド6": "画像素材/説明スライド/スライド6.PNG",  
  "スライド7": "画像素材/説明スライド/スライド7.PNG",
  "エンドスコア": "画像素材/説明スライド/エンドスコア.PNG"
}






voice_dic = {
  "エンペラー_1_1": "音声素材/セリフ/味方/エンペラー/エンペラー_1_1.mp3",
  "エンペラー_1_2": "音声素材/セリフ/味方/エンペラー/エンペラー_1_2.mp3",
  "エンペラー_1_3": "音声素材/セリフ/味方/エンペラー/エンペラー_1_3.mp3",
  "エンペラー_2_1": "音声素材/セリフ/味方/エンペラー/エンペラー_2_1.mp3",
  "エンペラー_2_2": "音声素材/セリフ/味方/エンペラー/エンペラー_2_2.mp3",
  "エンペラー_2_3": "音声素材/セリフ/味方/エンペラー/エンペラー_2_3.mp3",
  "エンペラー_2_4": "音声素材/セリフ/味方/エンペラー/エンペラー_2_4.mp3",
  "エンペラー_3_1": "音声素材/セリフ/味方/エンペラー/エンペラー_3_1.mp3",
  "エンペラー_3_2": "音声素材/セリフ/味方/エンペラー/エンペラー_3_2.mp3",
  "エンペラー_3_3": "音声素材/セリフ/味方/エンペラー/エンペラー_3_3.mp3",
  "エンペラー_4_1": "音声素材/セリフ/味方/エンペラー/エンペラー_4_1.mp3",
  "エンペラー_4_2": "音声素材/セリフ/味方/エンペラー/エンペラー_4_2.mp3",
  "エンペラー_4_3": "音声素材/セリフ/味方/エンペラー/エンペラー_4_3.mp3",
  "エンペラー_合体_1": "音声素材/セリフ/味方/エンペラー/エンペラー_合体_1.mp3",
  "エンペラー_合体_2": "音声素材/セリフ/味方/エンペラー/エンペラー_合体_2.mp3",
  "エンペラー_合体_3": "音声素材/セリフ/味方/エンペラー/エンペラー_合体_3.mp3",
  "エンペラー_分離": "音声素材/セリフ/味方/エンペラー/エンペラー_分離.mp3",
    
  "カイザー_1_1": "音声素材/セリフ/味方/カイザー/カイザー_1_1.mp3",
  "カイザー_1_2": "音声素材/セリフ/味方/カイザー/カイザー_1_2.mp3",
  "カイザー_1_3": "音声素材/セリフ/味方/カイザー/カイザー_1_3.mp3",
  "カイザー_2_1": "音声素材/セリフ/味方/カイザー/カイザー_2_1.mp3",
  "カイザー_2_2": "音声素材/セリフ/味方/カイザー/カイザー_2_2.mp3",
  "カイザー_2_3": "音声素材/セリフ/味方/カイザー/カイザー_2_3.mp3",
  "カイザー_3_1": "音声素材/セリフ/味方/カイザー/カイザー_3_1.mp3",
  "カイザー_3_2": "音声素材/セリフ/味方/カイザー/カイザー_3_2.mp3",
  "カイザー_3_3": "音声素材/セリフ/味方/カイザー/カイザー_3_3.mp3",
  "カイザー_4_1": "音声素材/セリフ/味方/カイザー/カイザー_4_1.mp3",
  "カイザー_4_2": "音声素材/セリフ/味方/カイザー/カイザー_4_2.mp3",
  "カイザー_4_3": "音声素材/セリフ/味方/カイザー/カイザー_4_3.mp3",
  "カイザー_合体_1": "音声素材/セリフ/味方/カイザー/カイザー_合体_1.mp3",
  "カイザー_合体_2": "音声素材/セリフ/味方/カイザー/カイザー_合体_2.mp3",
  "カイザー_合体_3": "音声素材/セリフ/味方/カイザー/カイザー_合体_3.mp3",
  "カイザー_分離": "音声素材/セリフ/味方/カイザー/カイザー_分離.mp3",
  
  "ミカド_1_1": "音声素材/セリフ/味方/ミカド/ミカド_1_1.mp3",
  "ミカド_1_2": "音声素材/セリフ/味方/ミカド/ミカド_1_2.mp3",
  "ミカド_1_3": "音声素材/セリフ/味方/ミカド/ミカド_1_3.mp3",
  "ミカド_2_1": "音声素材/セリフ/味方/ミカド/ミカド_2_1.mp3",
  "ミカド_2_2": "音声素材/セリフ/味方/ミカド/ミカド_2_2.mp3",
  "ミカド_2_3": "音声素材/セリフ/味方/ミカド/ミカド_2_3.mp3",
  "ミカド_3_1": "音声素材/セリフ/味方/ミカド/ミカド_3_1.mp3",
  "ミカド_3_2": "音声素材/セリフ/味方/ミカド/ミカド_3_2.mp3",
  "ミカド_3_331": "音声素材/セリフ/味方/ミカド/ミカド_3_3.mp3",
  "ミカド_3_4": "音声素材/セリフ/味方/ミカド/ミカド_3_4.mp3",
  "ミカド_4_1": "音声素材/セリフ/味方/ミカド/ミカド_4_1.mp3",
  "ミカド_4_2": "音声素材/セリフ/味方/ミカド/ミカド_4_2.mp3",
  "ミカド_4_3": "音声素材/セリフ/味方/ミカド/ミカド_4_3.mp3",
  "ミカド_合体_1": "音声素材/セリフ/味方/ミカド/ミカド_合体_1.mp3",
  "ミカド_合体_2": "音声素材/セリフ/味方/ミカド/ミカド_合体_2.mp3",
  "ミカド_合体_3": "音声素材/セリフ/味方/ミカド/ミカド_合体_3.mp3",
  "ミカド_分離": "音声素材/セリフ/味方/ミカド/ミカド_分離.mp3",
  
  "セイメイ_起動_エンペラー": "音声素材/セリフ/セイメイ/セイメイ_起動_エンペラー.mp3",
  "セイメイ_起動_カイザー": "音声素材/セリフ/セイメイ/セイメイ_起動_カイザー.mp3",
  "セイメイ_起動_ミカド": "音声素材/セリフ/セイメイ/セイメイ_起動_ミカド.mp3",
  "セイメイ_起動_マシン": "音声素材/セリフ/セイメイ/セイメイ_起動_マシン.mp3",
  "セイメイ_攻撃_1": "音声素材/セリフ/セイメイ/セイメイ_攻撃_1.mp3",
  "セイメイ_攻撃_2": "音声素材/セリフ/セイメイ/セイメイ_攻撃_2.mp3",
  "セイメイ_特殊_1": "音声素材/セリフ/セイメイ/セイメイ_特殊_1.mp3"
}